{"format": "layers-model", "generatedBy": "keras v2.21.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.21.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "kumpas_web", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 40, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "landmark_sequence", "optional": false}, "name": "landmark_sequence", "inbound_nodes": []}, {"class_name": "Conv1D", "config": {"name": "temporal_conv_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "temporal_conv_1", "inbound_nodes": [[["landmark_sequence", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_norm_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_norm_1", "inbound_nodes": [[["temporal_conv_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_1", "inbound_nodes": [[["batch_norm_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "temporal_pool", "trainable": true, "dtype": "float32", "strides": [2], "pool_size": [2], "padding": "valid", "data_format": "channels_last"}, "name": "temporal_pool", "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "temporal_conv_2", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "temporal_conv_2", "inbound_nodes": [[["temporal_pool", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_norm_2", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_norm_2", "inbound_nodes": [[["temporal_conv_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "relu_2", "inbound_nodes": [[["batch_norm_2", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "config": {"name": "temporal_average", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}, "name": "temporal_average", "inbound_nodes": [[["relu_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.3, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["temporal_average", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "embedding", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "embedding", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_2", "inbound_nodes": [[["embedding", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "sign_probabilities", "trainable": true, "dtype": "float32", "units": 14, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "sign_probabilities", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "input_layers": [["landmark_sequence", 0, 0]], "output_layers": [["sign_probabilities", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_norm_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_norm_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_norm_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_norm_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_norm_2/gamma", "shape": [96], "dtype": "float32"}, {"name": "batch_norm_2/beta", "shape": [96], "dtype": "float32"}, {"name": "batch_norm_2/moving_mean", "shape": [96], "dtype": "float32"}, {"name": "batch_norm_2/moving_variance", "shape": [96], "dtype": "float32"}, {"name": "embedding/kernel", "shape": [96, 64], "dtype": "float32"}, {"name": "embedding/bias", "shape": [64], "dtype": "float32"}, {"name": "sign_probabilities/kernel", "shape": [64, 14], "dtype": "float32"}, {"name": "sign_probabilities/bias", "shape": [14], "dtype": "float32"}, {"name": "temporal_conv_1/kernel", "shape": [5, 128, 64], "dtype": "float32"}, {"name": "temporal_conv_1/bias", "shape": [64], "dtype": "float32"}, {"name": "temporal_conv_2/kernel", "shape": [3, 64, 96], "dtype": "float32"}, {"name": "temporal_conv_2/bias", "shape": [96], "dtype": "float32"}]}]}